Revit 2027 API
ImageExportOptions.Zoom Property
 The value for Zoom (as a percentage). Used only when ZoomType is Zoom.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Zoom { get; set; }
Public Property Zoom As Integer
	Get
	Set
public:
property int Zoom {
	int get ();
	void set (int value);
}
member Zoom : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The Zoom value is outside the permitted range.
Remarks
 The default is 50.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace